org/articles/Database/2018-02-08-semi-repl.org
#+BEGIN_HTML
---
date: 2018-02-08 15:37:18
template: tech.jade
title: MySQL semi-replication wait point的问题
category: Database
chage_frequency: monthly
tag: mysql
---
#+END_HTML
#+OPTIONS: toc:nil
#+TOC: headlines 2

在MySQL半同步机制中，关于事务提交与等待Slave确认binlog复制完成有一个可选项，可以配置事务提交前/后等待slave完成复制。

=rpl_semi_sync_master_wait_point=

- AFTER_SYNC 刷binlog日志到磁盘后，发起等待，Slave应答后，再Commit事务
- AFTER_COMMIT 刷binlog日志到磁盘，commit 事务，然后发起等待，Slave 应答后回应Client事务完成

2种不同的同步点，决定了MySQL在主库故障后recover时的情况。

=AFTER_SYNC= 情形下，主库可能有未提交的事务，而Slave已提交，即主库的事务可能比备库少。

=AFTER_COMMIT= 情形下，主库事务可能会多于备库，这与异步复制时候是相同的。

MySQL默认的配置是 =AFTER_SYNC= 。也就是会存在主库事务少于备库的情形。
